// Дана json-строка (можно сохранить в файл и читать из файла)
// [{"фамилия":"Иванов","оценка":"5","предмет":"Математика"},{"фамилия":"Петрова","оценка":"4","предмет":"Информатика"},{"фамилия":"Краснов","оценка":"5","предмет":"Физика"}]
// Написать метод(ы), который распарсит json и, используя StringBuilder, создаст строки вида: Студент [фамилия] получил [оценка] по предмету [предмет].
// Пример вывода:
// Студент Иванов получил 5 по предмету Математика.
// Студент Петрова получил 4 по предмету Информатика.
// Студент Краснов получил 5 по предмету Физика.

public class second {
    public static void main(String[] args) {
        System.out.println();
        String a = "[{\"фамилия\":\"Иванов\",\"оценка\":\"5\",\"предмет\":\"Математика\"},{\"фамилия\":\"Петрова\",\"оценка\":\"4\",\"предмет\":\"Информатика\"},{\"фамилия\":\"Краснов\",\"оценка\":\"5\",\"предмет\":\"Физика\"}]";
        String[] arr_a = a.split("}");
        for (int n = 0; n < arr_a.length - 1; n++)
            System.out.println(Parse_Func(arr_a[n]));
    }

    static String Parse_Func(String a) {
        a = a.replace(",", "").replace("{", "").replace(":", "")
                .replace("[", "").replace("]", "").replace("\"", "");
        a = a.replace("фамилия", "Студент ").replace("оценка", " получил ").replace("предмет", " по предмету ");
        return a + ".";
    }
}
